app/controllers/books_controller.rb

  def create
    @book = Book.create(name: params[:name])
---
INSERT INTO "books" ("name", "publishing_year", "num_of_pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Harry Potter"], ["publishing_year", nil], ["num_of_pages", nil], ["created_at", "2022-02-16 21:59:02.655061"], ["updated_at", "2022-02-16 21:59:02.655061"]]